#ДЗ 4.2. Знайти суму елементів із парними індексами
lst = [0, 1, 7, 2, 4, 8, 5, 4, 6]
print(lst,"=>(",end='') #вивід початкового списку
lst1=lst[::2] #зріз списка - елементів списку з парними індексами
lenl1=len(lst1)
i=0
ii=0
suma=0
while ii<lenl1: #друкуємо вираз
   if ii!=lenl1-1:
       print(lst1[ii],"+",end='')
       ii+=1
   else: #для останнього елемента виразу не потрібний +
       print(lst1[ii],end='')
       break
while i<lenl1: #рахуємо суму елементів списку з парними індексами
   suma=suma+lst1[i]
   i+=1
rez=suma*lst[-1]
print(")*",lst[-1],"=",rez) # результат сума помножена на останній елемент початкового списку
